//*****************************************************************************
// 入力処理 (input.h)
// Author : YUHEI KAN
//*****************************************************************************
#ifndef _INPUT_H_
#define _INPUT_H_

//*****************************************************************************
// ヘッダファイル
//*****************************************************************************
#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define NUM_KEY_MAX     (256)   // キー最大数

//*****************************************************************************
// クラス
//*****************************************************************************
//入力クラス
class CInput
{
public:
    CInput();                                           //コンストラクタ
    virtual ~CInput();                                  //デコンストラクタ

    virtual HRESULT Init(HINSTANCE hInst, HWND hWnd);   //初期化処理
    virtual void Uninit(void);                          //終了処理
    virtual void Update(void) = 0;                      //---> 純粋仮想関数化

protected:
    static LPDIRECTINPUT8 m_pDInput;                    //DirectInputオブジェクト
};

#endif _INPUT_H_