//*************************************************************************************************
// メッシュウォール処理 (meshWall.h)
// Author : YUHEI KAN
//*************************************************************************************************
#ifndef _MESHWALL_H_
#define _MESHWALL_H_

//*************************************************************************************************
// インクルードファイル
//*************************************************************************************************

//*************************************************************************************************
// マクロ定義 
//*************************************************************************************************

//*************************************************************************************************
// 構造体
//*************************************************************************************************

//*************************************************************************************************
// クラス
//*************************************************************************************************
//メッシュウォールクラス
class CMeshWall:public CScene3D
{
public:
    CMeshWall ( int nPriolity = 3 );            //コンストラクタ
    ~CMeshWall ( );                             //デコンストラクタ

    HRESULT Init ( void );                      //初期化処理
    void Uninit ( void );                       //終了処理
    void Update ( void );                       //更新処理
    void Draw ( void );                         //描画処理

    static CMeshWall *Create ( D3DXVECTOR3 FrontPos, 
                               D3DXVECTOR3 FrontSize, 
                               D3DXCOLOR FrontColor, 
                               int nFrontBlockNum_X, 
                               int nFrontBlockNum_Y, 
                               D3DXVECTOR3 LeftPos, 
                               D3DXVECTOR3 LeftSize,
                               D3DXCOLOR LeftColor, 
                               int nLeftBlockNum_X,
                               int nLeftBlockNum_Y,
                               int nPriority = 3 );   //自身を生成
protected:

private:
    D3DXVECTOR3 m_FrontPos;                     //奥座標
    D3DXVECTOR3 m_FrontSize;                    //奥サイズ
    D3DXCOLOR m_FrontColor;                     //奥の色
    int m_FrontBlockNum_X;                      //ブロックの横の分割数(奥)
    int m_FrontBlockNum_Y;                      //ブロックの縦の分割数(奥)
    D3DXVECTOR3 m_LeftPos;                      //左座標
    D3DXVECTOR3 m_LeftSize;                     //左サイズ
    D3DXCOLOR m_LeftColor;                      //左の色
    int m_LeftBlockNum_X;                       //ブロックの横の分割数(左)
    int m_LeftBlockNum_Y;                       //ブロックの縦の分割数(左)
};

//*************************************************************************************************
// プロトタイプ宣言
//*************************************************************************************************

#endif //_MESHWALL_H_