//*************************************************************************************************
// ランキング処理 (ranking.h)
// Author : YUHEI KAN
//*************************************************************************************************
#ifndef _RANKING_H_
#define _RANKING_H_

//*************************************************************************************************
// インクルードファイル
//*************************************************************************************************

//*************************************************************************************************
// マクロ定義
//*************************************************************************************************

//*************************************************************************************************
// 構造体
//*************************************************************************************************

//*************************************************************************************************
// クラス
//*************************************************************************************************
//ランキングクラス
class CRanking :public CScene2D
{
public:
    CRanking(int nPriolity = 3);              //コンストラクタ
    ~CRanking();                              //デコンストラクタ

    HRESULT Init(void);                         //初期化処理
    void Uninit(void);                          //終了処理
    void Update(void);                          //更新処理
    void Draw(void);                            //描画処理

    static CRanking *Create(
        D3DXVECTOR3 Pos,
        int nPriolity = 3);                     //自身を生成

    int GetRanking(void);                       //ランキング数値の取得

    void SetRanking(int Num);                   //ランキング数値の設定

private:
    void rotation2D(float * xp, float * yp,
        float x, float y, float xc, float yc,
        float theta);                           //回転処理

    LPDIRECT3DTEXTURE9      m_pTexture;         //テクスチャへのポインタ
    LPDIRECT3DVERTEXBUFFER9 m_pVtxBuff;         //頂点バッファへのポインタ
    int m_Ranking;                              //ランキング数値
    bool m_bCount;                              //ランキング表示判定
    float m_ColorA;                             //アルファ値
    int m_CountDawnStart;                       //ランキングスタートカウント
    bool m_PlayChange;                          //ランキングチェンジ時演出
    float m_angle;                              //回転角(演出用)
};

//*************************************************************************************************
// プロトタイプ宣言
//*************************************************************************************************

#endif //_RANKING_H_