//*************************************************************************************************
// モードリザルト処理 (modeResult.cpp)
// Author : YUHEI KAN
//*************************************************************************************************

//*************************************************************************************************
// インクルードファイル
//*************************************************************************************************
#include"manager.h"
#include "keyboard.h"
#include "joystick.h"
#include "sound.h"
#include "light.h"
#include "camera.h"
#include "mode.h"
#include "modeResult.h"
#include "modeTitle.h"
#include "scene.h"
#include "scene2D.h"
#include "pressenter.h"
#include "scene3D.h"
#include "meshBox.h"

//*************************************************************************************************
// マクロ定義 
//*************************************************************************************************

//*************************************************************************************************
// 構造体
//*************************************************************************************************

//*************************************************************************************************
// クラス
//*************************************************************************************************

//*************************************************************************************************
// グローバル変数
//*************************************************************************************************
CCamera *CModeResult::m_Camera = NULL;            //カメラクラスのポインタ
CLight *CModeResult::m_CLight = NULL;             //ライトクラスのポインタ

//*************************************************************************************************
// プロトタイプ宣言
//*************************************************************************************************

//*************************************************************************************************
// モードリザルトのコンストラクタ
//*************************************************************************************************
CModeResult::CModeResult ( )
{
}

//*************************************************************************************************
// モードリザルトのデストラクタ
//*************************************************************************************************
CModeResult::~CModeResult ()
{
}

//*************************************************************************************************
// 初期化処理
//*************************************************************************************************
HRESULT CModeResult::Init( void )
{
    //ライトクラスの生成と初期化
    m_CLight = new CLight;
    if (FAILED(m_CLight->Init()))
    {
        return E_FAIL;
    }

    //カメラクラスの生成と初期化
    m_Camera = new CCamera;
    if (FAILED(m_Camera->Init()))
    {
        return E_FAIL;
    }

    m_Camera->SetPos(D3DXVECTOR3(3000.0f, 8000.0f, 0.0f));

    //メッシュボックスクラスの生成と初期化
    CMeshBox::Create(D3DXVECTOR3(0.0f, 0.0f, 0.0f),
        D3DXVECTOR3(50000.0f, 50000.0f, 0.0f),
        D3DXCOLOR(1.0f, 1.0f, 1.0f, 1.0f));

    //シーン2Dクラスの生成
    CScene2D::Create ( "data/TEXTURE/result.png",
        D3DXVECTOR3((SCREEN_WIDTH - (SCREEN_WIDTH * 9.0f * 0.0854f)) / 2.0f, (SCREEN_HEIGHT - (SCREEN_HEIGHT * 16.0f * 0.0251f)) / 4.0f, 0.0f),
        D3DXVECTOR3(SCREEN_WIDTH * 9 * 0.0854f, SCREEN_HEIGHT * 16 * 0.0251f, 0.0f),
                       D3DXCOLOR ( 1.0f, 1.0f, 1.0f, 1.0f ),
                       D3DXVECTOR2 ( 0.0f, 0.0f ),
                       D3DXVECTOR2 ( 1.0f, 1.0f ),
                       4 );

    //プレスエンタークラスの生成と初期化
    m_Pressenter = CPressenter::Create(D3DXVECTOR3(0.0f, 0.0f, 0.0f), 4);

    //リザルトBGMを再生する
    CManager::GetSound()->Play(CSound::SOUND_LABEL_BGM_RESULT);

    return S_OK;
}

//*************************************************************************************************
// 終了処理
//*************************************************************************************************
void CModeResult::Uninit( void )
{
    //シーンクラスの全ての終了処理
    CScene::ReleaseAll();

    //カメラクラスの終了処理
    if (m_Camera != NULL)
    {
        m_Camera->Uninit();
        delete m_Camera;
        m_Camera = NULL;
    }

    //ライトクラスの終了処理
    if (m_CLight != NULL)
    {
        m_CLight->Uninit();
        delete m_CLight;
        m_CLight = NULL;
    }
}

//*************************************************************************************************
// 更新処理
//*************************************************************************************************
void CModeResult::Update( void )
{
    //ライトクラスの更新
    m_CLight->Update();

    //カメラクラスの更新
    m_Camera->Update();

    //Y軸回転角度の加算
    m_Camera->AddAngleY(D3DX_PI * 0.001f);

    //モードの設定
    if ( CManager::GetInputKeyboard ( )->GetKeyTrigger ( DIK_SPACE ) || 
         CManager::GetInputJoystick()->GetJoyTrigger(CInputJoystick::DIJ_BUTTON, DIJ_CIRCLE) )
    {
        //再生
        CManager::GetSound()->Play(CSound::SOUND_LABEL_SE_ENTER);

        //リザルトBGMを停止する
        CManager::GetSound()->Stop(CSound::SOUND_LABEL_BGM_RESULT);

        CManager::SetMode ( new CModeTitle );
    }
}

//*************************************************************************************************
// 描画処理
//*************************************************************************************************
void CModeResult::Draw( void )
{
    //カメラをセットする
    m_Camera->Set();
}